xmlFiles/xmlWithIdsAndFail.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <RequestHeader xmlns="http://schemas.microsoft.com/TeamFoundation/2005/06/WorkItemTracking/ClientServices/03">
            <Id>uuid:6e695bff-9969-480e-97aa-07689dcb8b30</Id>
        </RequestHeader>
    </s:Header>
    <s:Body>
        <PageWorkitemsByIds xmlns="http://schemas.microsoft.com/TeamFoundation/2005/06/WorkItemTracking/ClientServices/03">
            <ids>
                <int>131771</int>
                <int>131739</int>
                <int>131723</int>
                <int>131680</int>
                <int>131738</int>
                <int>118285</int>
                <int>122972</int>
                <int>132592</int>
                <int>131999</int>
                <int>131997</int>
                <int>131029</int>
                <int>130962</int>
                <int>130784</int>
                <int>130579</int>
                <int>130564</int>
                <int>130563</int>
                <int>130561</int>
                <int>130430</int>
                <int>131311</int>
                <int>131325</int>
                <int>131333</int>
                <int>131531</int>
                <int>131447</int>
                <int>131449</int>
                <int>131452</int>
                <int>131458</int>
                <int>131459</int>
                <int>131468</int>
                <int>131495</int>
                <int>131496</int>
                <int>131538</int>
                <int>132458</int>
                <int>132459</int>
                <int>132365</int>
                <int>132369</int>
                <int>132388</int>
                <int>132474</int>
                <int>132476</int>
                <int>132477</int>
                <int>132478</int>
                <int>132508</int>
                <int>132509</int>
                <int>132510</int>
                <int>132512</int>
                <int>132276</int>
                <int>132154</int>
                <int>130588</int>
                <int>131679</int>
                <int>130791</int>
                <int>128501</int>
                <int>130160</int>
                <int>131002</int>
                <int>131017</int>
                <int>131010</int>
                <int>130198</int>
                <int>130351</int>
                <int>130353</int>
                <int>131003</int>
                <int>131927</int>
                <int>131682</int>
                <int>132440</int>
                <int>132442</int>
                <int>132443</int>
                <int>132461</int>
                <int>123443</int>
                <int>123607</int>
                <int>123598</int>
                <int>123650</int>
                <int>127077</int>
                <int>124098</int>
                <int>123608</int>
                <int>123665</int>
                <int>124141</int>
                <int>123592</int>
                <int>131993</int>
                <int>132456</int>
                <int>123601</int>
                <int>123933</int>
                <int>123725</int>
                <int>131117</int>
                <int>132507</int>
                <int>132513</int>
                <int>132515</int>
                <int>132516</int>
                <int>132517</int>
                <int>132518</int>
                <int>132519</int>
                <int>132520</int>
                <int>132521</int>
                <int>132522</int>
                <int>128226</int>
                <int>128243</int>
                <int>128252</int>
                <int>128722</int>
                <int>128253</int>
                <int>128515</int>
                <int>128519</int>
                <int>128523</int>
                <int>128608</int>
                <int>128683</int>
                <int>128717</int>
                <int>129053</int>
                <int>129342</int>
                <int>129497</int>
                <int>130507</int>
                <int>130589</int>
                <int>132384</int>
                <int>128715</int>
                <int>128721</int>
                <int>128810</int>
                <int>128820</int>
                <int>128875</int>
                <int>128843</int>
                <int>128844</int>
                <int>128855</int>
                <int>128859</int>
                <int>128852</int>
                <int>128853</int>
                <int>128854</int>
                <int>131930</int>
                <int>131774</int>
                <int>132438</int>
                <int>132439</int>
                <int>132441</int>
                <int>132445</int>
                <int>132446</int>
                <int>132447</int>
                <int>132448</int>
                <int>132449</int>
                <int>132450</int>
                <int>132451</int>
                <int>132452</int>
                <int>132453</int>
                <int>132462</int>
                <int>132463</int>
                <int>132464</int>
                <int>132465</int>
                <int>132466</int>
                <int>132468</int>
                <int>132469</int>
                <int>132470</int>
                <int>132471</int>
                <int>132524</int>
                <int>132526</int>
                <int>132529</int>
                <int>132530</int>
                <int>132531</int>
                <int>132532</int>
                <int>132533</int>
                <int>132534</int>
                <int>132535</int>
                <int>132536</int>
                <int>132538</int>
                <int>132539</int>
                <int>132540</int>
                <int>132541</int>
                <int>132542</int>
                <int>132543</int>
                <int>132544</int>
                <int>132545</int>
                <int>126798</int>
                <int>127081</int>
                <int>127117</int>
                <int>132345</int>
                <int>132346</int>
                <int>132347</int>
                <int>132348</int>
                <int>132349</int>
                <int>132350</int>
                <int>132352</int>
                <int>132357</int>
                <int>132358</int>
                <int>132360</int>
                <int>132362</int>
                <int>132363</int>
                <int>132366</int>
                <int>132367</int>
                <int>132368</int>
                <int>132370</int>
                <int>132371</int>
                <int>132372</int>
                <int>132373</int>
                <int>132374</int>
                <int>132376</int>
                <int>132377</int>
                <int>132157</int>
                <int>130781</int>
                <int>130739</int>
                <int>130675</int>
                <int>130494</int>
                <int>130522</int>
                <int>130668</int>
                <int>130674</int>
                <int>131660</int>
                <int>131724</int>
                <int>132244</int>
                <int>132291</int>
                <int>132292</int>
                <int>132295</int>
                <int>132301</int>
                <int>132302</int>
                <int>132303</int>
                <int>132304</int>
                <int>132305</int>
                <int>132306</int>
                <int>132308</int>
                <int>132309</int>
                <int>132310</int>
                <int>132312</int>
            </ids>
            <columns>
                <string>System.Id</string>
                <string>TestType</string>
            </columns>
        </PageWorkitemsByIds>
    </s:Body>
</s:Envelope>